wagiminator/Development-Boards/CH32V203F6P6_DevBoard/software/debug/src/ch32v203.h
/* ETH10M Registers */
typedef struct
{
    __IO uint8_t reserved1;
    __IO uint8_t reserved2;
    __IO uint8_t reserved3;
    __IO uint8_t EIE;
    __IO uint8_t EIR;
    __IO uint8_t ESTAT;
    __IO uint8_t ECON2;
    __IO uint8_t ECON1;
    __IO uint16_t ETXST;
    __IO uint16_t ETXLN;
    __IO uint16_t ERXST;
    __IO uint16_t ERXLN;
    __IO uint32_t HTL;
    __IO uint32_t HTH;
    __IO uint8_t ERXFON;
    __IO uint8_t MACON1;
    __IO uint8_t MACON2;
    __IO uint8_t MABBIPG;
    __IO uint16_t EPAUS;
    __IO uint16_t MAMXFL;
    __IO uint16_t MIRD;
    __IO uint16_t reserved4;
    __IO uint8_t MIERGADR;
    __IO uint8_t MISTAT;
    __IO uint16_t MIWR;
    __IO uint32_t MAADRL;
    __IO uint16_t MAADRH;
    __IO uint16_t reserved5;
} ETH10M_TypeDef;

/* OSC Registers */
typedef struct
{
    __IO uint32_t HSE_CAL_CTRL;
    __IO uint32_t Reserve0;
    __IO uint16_t Reserve1;
    __IO uint16_t LSI32K_TUNE;
    __IO uint32_t Reserve2;
    __IO uint32_t Reserve3;
    __IO uint32_t Reserve4;
    __IO uint32_t Reserve5;
    __IO uint8_t  Reserve6;
    __IO uint8_t  LSI32K_CAL_CFG;
    __IO uint16_t Reserve7;
    __IO uint16_t LSI32K_CAL_STATR;
    __IO uint8_t  LSI32K_CAL_OV_CNT;
    __IO uint8_t  LSI32K_CAL_CTRL;
} OSC_TypeDef;

/* USBD registers */
typedef struct
{
    __IO uint16_t EPR0;
    uint16_t      RESERVED0;
    __IO uint16_t EPR1;
    uint16_t      RESERVED1;
    __IO uint16_t EPR2;
    uint16_t      RESERVED2;
    __IO uint16_t EPR3;
    uint16_t      RESERVED3;
    __IO uint16_t EPR4;
    uint16_t      RESERVED4;
    __IO uint16_t EPR5;
    uint16_t      RESERVED5;
    __IO uint16_t EPR6;
    uint16_t      RESERVED6;
    __IO uint16_t EPR7;
    uint16_t      RESERVED7;
    uint32_t      RESERVED8[8];
    __IO uint16_t CNTR;
    uint16_t      RESERVED10;
    __IO uint16_t ISTR;
    uint16_t      RESERVED11;
    __IO uint16_t FNR;
    uint16_t      RESERVED12;
    __IO uint16_t DADDR;
    uint16_t      RESERVED13;
    __IO uint16_t BTABLE;
    uint16_t      RESERVED14;
} USBD_TypeDef;

/* USBD buffer description registers */
typedef struct
{
    __IO uint16_t ADDR0_TX;
    uint16_t      RESERVED0;
    __IO uint16_t COUNT0_TX;
    uint16_t      RESERVED1;
    __IO uint16_t ADDR0_RX;
    uint16_t      RESERVED2;
    __IO uint16_t COUNT0_RX;
    uint16_t      RESERVED3;
    __IO uint16_t ADDR1_TX;
    uint16_t      RESERVED4;
    __IO uint16_t COUNT1_TX;
    uint16_t      RESERVED5;
    __IO uint16_t ADDR1_RX;
    uint16_t      RESERVED6;
    __IO uint16_t COUNT1_RX;
    uint16_t      RESERVED7;
    __IO uint16_t ADDR2_TX;
    uint16_t      RESERVED8;
    __IO uint16_t COUNT2_TX;
    uint16_t      RESERVED9;
    __IO uint16_t ADDR2_RX;
    uint16_t      RESERVEDa;
    __IO uint16_t COUNT2_RX;
    uint16_t      RESERVEDb;
    __IO uint16_t ADDR3_TX;
    uint16_t      RESERVEDc;
    __IO uint16_t COUNT3_TX;
    uint16_t      RESERVEDd;
    __IO uint16_t ADDR3_RX;
    uint16_t      RESERVEDe;
    __IO uint16_t COUNT3_RX;
    uint16_t      RESERVEDf;
    __IO uint16_t ADDR4_TX;
    uint16_t      RESERVED10;
    __IO uint16_t COUNT4_TX;
    uint16_t      RESERVED11;
    __IO uint16_t ADDR4_RX;
    uint16_t      RESERVED12;
    __IO uint16_t COUNT4_RX;
    uint16_t      RESERVED13;
    __IO uint16_t ADDR5_TX;
    uint16_t      RESERVED14;
    __IO uint16_t COUNT5_TX;
    uint16_t      RESERVED15;
    __IO uint16_t ADDR5_RX;
    uint16_t      RESERVED16;
    __IO uint16_t COUNT5_RX;
    uint16_t      RESERVED17;
    __IO uint16_t ADDR6_TX;
    uint16_t      RESERVED18;
    __IO uint16_t COUNT6_TX;
    uint16_t      RESERVED19;
    __IO uint16_t ADDR6_RX;
    uint16_t      RESERVED1a;
    __IO uint16_t COUNT6_RX;
    uint16_t      RESERVED1b;
    __IO uint16_t ADDR7_TX;
    uint16_t      RESERVED1c;
    __IO uint16_t COUNT7_TX;
    uint16_t      RESERVED1d;
    __IO uint16_t ADDR7_RX;
    uint16_t      RESERVED1e;
    __IO uint16_t COUNT7_RX;
    uint16_t      RESERVED1f;
} USBD_BUF_TypeDef;

/* USBFS Registers */
typedef struct
{
    __IO uint8_t  BASE_CTRL;
    __IO uint8_t  UDEV_CTRL;
    __IO uint8_t  INT_EN;
    __IO uint8_t  DEV_ADDR;
    __IO uint8_t  Reserve0;
    __IO uint8_t  MIS_ST;
    __IO uint8_t  INT_FG;
    __IO uint8_t  INT_ST;
    __IO uint32_t RX_LEN;
    __IO uint8_t  UEP4_1_MOD;
    __IO uint8_t  UEP2_3_MOD;
    __IO uint8_t  UEP5_6_MOD;
    __IO uint8_t  UEP7_MOD;
    __IO uint32_t UEP0_DMA;
    __IO uint32_t UEP1_DMA;
    __IO uint32_t UEP2_DMA;
    __IO uint32_t UEP3_DMA;
    __IO uint32_t UEP4_DMA;
    __IO uint32_t UEP5_DMA;
    __IO uint32_t UEP6_DMA;
    __IO uint32_t UEP7_DMA;
    __IO uint16_t UEP0_TX_LEN;
    __IO uint8_t  UEP0_TX_CTRL;
    __IO uint8_t  UEP0_RX_CTRL;
    __IO uint16_t UEP1_TX_LEN;
    __IO uint8_t  UEP1_TX_CTRL;
    __IO uint8_t  UEP1_RX_CTRL;
    __IO uint16_t UEP2_TX_LEN;
    __IO uint8_t  UEP2_TX_CTRL;
    __IO uint8_t  UEP2_RX_CTRL;
    __IO uint16_t UEP3_TX_LEN;
    __IO uint8_t  UEP3_TX_CTRL;
    __IO uint8_t  UEP3_RX_CTRL;
    __IO uint16_t UEP4_TX_LEN;
    __IO uint8_t  UEP4_TX_CTRL;
    __IO uint8_t  UEP4_RX_CTRL;
    __IO uint16_t UEP5_TX_LEN;
    __IO uint8_t  UEP5_TX_CTRL;
    __IO uint8_t  UEP5_RX_CTRL;
    __IO uint16_t UEP6_TX_LEN;
    __IO uint8_t  UEP6_TX_CTRL;
    __IO uint8_t  UEP6_RX_CTRL;
    __IO uint16_t UEP7_TX_LEN;
    __IO uint8_t  UEP7_TX_CTRL;
    __IO uint8_t  UEP7_RX_CTRL;
    __IO uint32_t Reserve1;
    __IO uint32_t OTG_CR;
    __IO uint32_t OTG_SR;
} USBOTG_FS_TypeDef;

typedef struct
{
    __IO uint8_t   BASE_CTRL;
    __IO uint8_t   HOST_CTRL;
    __IO uint8_t   INT_EN;
    __IO uint8_t   DEV_ADDR;
    __IO uint8_t   Reserve0;
    __IO uint8_t   MIS_ST;
    __IO uint8_t   INT_FG;
    __IO uint8_t   INT_ST;
    __IO uint16_t  RX_LEN;
    __IO uint16_t  Reserve1;
    __IO uint8_t   Reserve2;
    __IO uint8_t   HOST_EP_MOD;
    __IO uint16_t  Reserve3;
    __IO uint32_t  Reserve4;
    __IO uint32_t  Reserve5;
    __IO uint32_t  HOST_RX_DMA;
    __IO uint32_t  HOST_TX_DMA;
    __IO uint32_t  Reserve6;
    __IO uint32_t  Reserve7;
    __IO uint32_t  Reserve8;
    __IO uint32_t  Reserve9;
    __IO uint32_t  Reserve10;
    __IO uint16_t  Reserve11;
    __IO uint16_t  HOST_SETUP;
    __IO uint8_t   HOST_EP_PID;
    __IO uint8_t   Reserve12;
    __IO uint8_t   Reserve13;
    __IO uint8_t   HOST_RX_CTRL;
    __IO uint16_t  HOST_TX_LEN;
    __IO uint8_t   HOST_TX_CTRL;
    __IO uint8_t   Reserve14;
    __IO uint32_t  Reserve15;
    __IO uint32_t  Reserve16;
    __IO uint32_t  Reserve17;
    __IO uint32_t  Reserve18;
    __IO uint32_t  Reserve19;
    __IO uint32_t  OTG_CR;
    __IO uint32_t  OTG_SR;
} USBOTG_FS_HOST_TypeDef;

