wagiminator/Development-Boards/CH32V203F6P6_DevBoard/software/debug/src/ch32v203.h
#define PHY_Reset                               ((uint16_t)0x8000)      /* PHY Reset */

#define PHY_AutoNego_Complete                   ((uint16_t)0x0020)      /* Auto-Negotioation process completed */

//MII control
#define  RB_ETH_MIREGADR_MIIWR  0x20                                            /* WO MII write command */
#define  RB_ETH_MIREGADR_MIRDL  0x1f                                            /* RW PHY register address */

/******************************************************************************/
/*                                  USBD                                      */
/******************************************************************************/

/******************  CNTR control register bits definitions  ******************/
#define USBD_CNTR_CTRM                          ((uint16_t)0x8000) /* Correct TRansfer Mask */
#define USBD_CNTR_DOVRM                         ((uint16_t)0x4000) /* DMA OVeR/underrun Mask */
#define USBD_CNTR_ERRM                          ((uint16_t)0x2000) /* ERRor Mask */
#define USBD_CNTR_WKUPM                         ((uint16_t)0x1000) /* WaKe UP Mask */
#define USBD_CNTR_SUSPM                         ((uint16_t)0x0800) /* SUSPend Mask */
#define USBD_CNTR_RESETM                        ((uint16_t)0x0400) /* RESET Mask   */
#define USBD_CNTR_SOFM                          ((uint16_t)0x0200) /* Start Of Frame Mask */
#define USBD_CNTR_ESOFM                         ((uint16_t)0x0100) /* Expected Start Of Frame Mask */
#define USBD_CNTR_RESUME                        ((uint16_t)0x0010) /* RESUME request */
#define USBD_CNTR_FSUSP                         ((uint16_t)0x0008) /* Force SUSPend */
#define USBD_CNTR_LPMODE                        ((uint16_t)0x0004) /* Low-power MODE */
#define USBD_CNTR_PDWN                          ((uint16_t)0x0002) /* Power DoWN */
#define USBD_CNTR_FRES                          ((uint16_t)0x0001) /* Force USB RESet */

/**************************  ISTR interrupt events  ***************************/
#define USBD_ISTR_CTR                           ((uint16_t)0x8000) /* Correct TRansfer (clear-only bit) */
#define USBD_ISTR_DOVR                          ((uint16_t)0x4000) /* DMA OVeR/underrun (clear-only bit) */
#define USBD_ISTR_ERR                           ((uint16_t)0x2000) /* ERRor (clear-only bit) */
#define USBD_ISTR_WKUP                          ((uint16_t)0x1000) /* WaKe UP (clear-only bit) */
#define USBD_ISTR_SUSP                          ((uint16_t)0x0800) /* SUSPend (clear-only bit) */
#define USBD_ISTR_RESET                         ((uint16_t)0x0400) /* RESET (clear-only bit) */
#define USBD_ISTR_SOF                           ((uint16_t)0x0200) /* Start Of Frame (clear-only bit) */
#define USBD_ISTR_ESOF                          ((uint16_t)0x0100) /* Expected Start Of Frame (clear-only bit) */
#define USBD_ISTR_DIR                           ((uint16_t)0x0010) /* DIRection of transaction (read-only bit)  */
#define USBD_ISTR_EP_ID                         ((uint16_t)0x000F) /* EndPoint IDentifier (read-only bit)  */

/*****************  FNR Frame Number Register bit definitions  ****************/
#define USBD_FNR_RXDP                           ((uint16_t)0x8000) /* status of D+ data line */
#define USBD_FNR_RXDM                           ((uint16_t)0x4000) /* status of D- data line */
#define USBD_FNR_LCK                            ((uint16_t)0x2000) /* LoCKed */
#define USBD_FNR_LSOF                           ((uint16_t)0x1800) /* Lost SOF */
#define USBD_FNR_FN                             ((uint16_t)0x07FF) /* Frame Number */

/*******************  DADDR Device ADDRess bit definitions  *******************/
#define USBD_DADDR_EF                           ((uint8_t)0x80)    /* USB function enable */
#define USBD_DADDR_ADD                          ((uint8_t)0x7F)    /* USB device address */

/***************************  Endpoint registers  *****************************/
/* bit positions */
#define USBD_EP_CTR_RX                          ((uint16_t)0x8000) /* EndPoint Correct TRansfer RX */
#define USBD_EP_DTOG_RX                         ((uint16_t)0x4000) /* EndPoint Data TOGGLE RX */
#define USBD_EPRX_STAT                          ((uint16_t)0x3000) /* EndPoint RX STATus bit field */
#define USBD_EP_SETUP                           ((uint16_t)0x0800) /* EndPoint SETUP */
#define USBD_EP_T_FIELD                         ((uint16_t)0x0600) /* EndPoint TYPE */
#define USBD_EP_KIND                            ((uint16_t)0x0100) /* EndPoint KIND */
#define USBD_EP_CTR_TX                          ((uint16_t)0x0080) /* EndPoint Correct TRansfer TX */
#define USBD_EP_DTOG_TX                         ((uint16_t)0x0040) /* EndPoint Data TOGGLE TX */
#define USBD_EPTX_STAT                          ((uint16_t)0x0030) /* EndPoint TX STATus bit field */
#define USBD_EPADDR_FIELD                       ((uint16_t)0x000F) /* EndPoint ADDRess FIELD */
#define USBD_EP_STAT                            (USBD_EPRX_STAT|USBD_EPTX_STAT)

/* EndPoint REGister MASK (no toggle fields) */
#define USBD_EPREG_MASK (USBD_EP_CTR_RX|USBD_EP_SETUP|USBD_EP_T_FIELD|USBD_EP_KIND|USBD_EP_CTR_TX|USBD_EPADDR_FIELD)

/* EP_TYPE[1:0] EndPoint TYPE */
#define USBD_EP_TYPE_MASK                       ((uint16_t)0x0600) /* EndPoint TYPE Mask */
#define USBD_EP_BULK                            ((uint16_t)0x0000) /* EndPoint BULK */
#define USBD_EP_CONTROL                         ((uint16_t)0x0200) /* EndPoint CONTROL */
#define USBD_EP_ISOCHRONOUS                     ((uint16_t)0x0400) /* EndPoint ISOCHRONOUS */
#define USBD_EP_INTERRUPT                       ((uint16_t)0x0600) /* EndPoint INTERRUPT */
#define USBD_EP_T_MASK                          (~USBD_EP_T_FIELD & USBD_EPREG_MASK)

/* EP_KIND EndPoint KIND */
#define USBD_EPKIND_MASK                        (~USBD_EP_KIND & USBD_EPREG_MASK)

/* STAT_TX[1:0] STATus for TX transfer */
#define USBD_EP_TX_DIS                          ((uint16_t)0x0000) /* EndPoint TX DISabled */
#define USBD_EP_TX_STALL                        ((uint16_t)0x0010) /* EndPoint TX STALLed */
#define USBD_EP_TX_NAK                          ((uint16_t)0x0020) /* EndPoint TX NAKed */
#define USBD_EP_TX_ACK                          ((uint16_t)0x0030) /* EndPoint TX ACKed */
#define USBD_EPTX_DTOG1                         ((uint16_t)0x0010) /* EndPoint TX Data TOGgle bit1 */
#define USBD_EPTX_DTOG2                         ((uint16_t)0x0020) /* EndPoint TX Data TOGgle bit2 */
#define USBD_EPTX_DTOGMASK                      (USBD_EPTX_STAT|USBD_EPREG_MASK)

