wagiminator/Development-Boards/CH32V203F6P6_DevBoard/software/debug/src/ch32v203.h
/* STAT_RX[1:0] STATus for RX transfer */
#define USBD_EP_RX_DIS                          ((uint16_t)0x0000) /* EndPoint RX DISabled */
#define USBD_EP_RX_STALL                        ((uint16_t)0x1000) /* EndPoint RX STALLed */
#define USBD_EP_RX_NAK                          ((uint16_t)0x2000) /* EndPoint RX NAKed */
#define USBD_EP_RX_ACK                          ((uint16_t)0x3000) /* EndPoint RX ACKed */
#define USBD_EPRX_DTOG1                         ((uint16_t)0x1000) /* EndPoint RX Data TOGgle bit1 */
#define USBD_EPRX_DTOG2                         ((uint16_t)0x2000) /* EndPoint RX Data TOGgle bit1 */
#define USBD_EPRX_DTOGMASK                      (USBD_EPRX_STAT|USBD_EPREG_MASK)

/******************************************************************************/
/*               Programmable Fast Interrupt Controller (PFIC)                */
/******************************************************************************/

/******************  Bit definition for PFIC_CFGR register  *******************/
#define PFIC_RESETSYS                           ((uint32_t)0x00000080) /* System reset */
#define PFIC_KEY1                               ((uint32_t)0xFA050000)
#define PFIC_KEY2                               ((uint32_t)0xBCAF0000)
#define PFIC_KEY3                               ((uint32_t)0xBEEF0000)
#define NVIC_KEY1                               ((uint32_t)0xFA050000)
#define NVIC_KEY2                               ((uint32_t)0xBCAF0000)
#define NVIC_KEY3                               ((uint32_t)0xBEEF0000)

/******************  Bit definition for PFIC_SCTLR register  ******************/
#define PFIC_SYSRESET                           ((uint32_t)0x80000000) /* System reset */
#define PFIC_SETEVENT                           ((uint32_t)0x00000020) /* Set event to wake up WFE case */
#define PFIC_SEVONPEND                          ((uint32_t)0x00000010) /* All events and IRQ can wake up */
#define PFIC_WFITOWFE                           ((uint32_t)0x00000008) /* Treat WFI as WFE */
#define PFIC_SLEEPDEEP                          ((uint32_t)0x00000004) /* 1:deep sleep; 0:sleep */
#define PFIC_SLEEPONEXIT                        ((uint32_t)0x00000002) /* 1:sleep after ISR */

/******************************************************************************/
/*                       System Counter (STK / SysTick)                       */
/******************************************************************************/

/*******************  Bit definition for STK_CTLR register  *******************/
#define STK_CTLR_STE                            ((uint32_t)0x00000001) /* System counter enable */
#define STK_CTLR_STIE                           ((uint32_t)0x00000002) /* Counter interrupt enable */
#define STK_CTLR_STCLK                          ((uint32_t)0x00000004) /* 1: use HCLK; 0: use HCLK/8 */
#define STK_CTLR_STRE                           ((uint32_t)0x00000008) /* Auto-reload count enable */
#define STK_CTLR_MODE                           ((uint32_t)0x00000010) /* 0: upcount, 1: down count */
#define STK_CTLR_INIT                           ((uint32_t)0x00000020) /* counter init value update */
#define STK_CTLR_SWIE                           ((uint32_t)0x80000000) /* Software interrupt enable */

/********************  Bit definition for STK_SR register  ********************/
#define STK_SR_CNTIF                            ((uint8_t)0x01)        /* Count value comparison flag */

#ifdef __cplusplus
}
#endif
